
## Plan Result (aws/eks)

[CI link](https://github.com/44smkn/terraform/actions/runs/1975384183)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 2 to change, 10 to destroy.</code></pre>

* Create
  * module.eks.module.eks.aws_eks_cluster.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_autoscaling_group.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_iam_instance_profile.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_iam_role.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_launch_template.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;karpenter&#34;].aws_security_group.this[0]
* Update
  * module.eks.aws_iam_instance_profile.karpenter
  * module.eks.module.iam_assumable_role_karpenter.aws_iam_role.this[0]
* Delete
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_autoscaling_group.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_instance_profile.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_launch_template.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_security_group.this[0]
* Replace
  * module.eks.aws_iam_role_policy_attachment.karpenter_ssm_policy
  * module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.eks.aws_iam_instance_profile.karpenter will be updated in-place
  ~ resource "aws_iam_instance_profile" "karpenter" {
        id          = "KarpenterNodeInstanceProfile-44smkn-test"
        name        = "KarpenterNodeInstanceProfile-44smkn-test"
      ~ role        = "karpenter-controller-node-group-20220312165226457900000002" -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.karpenter_ssm_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "karpenter_ssm_policy" {
      ~ id         = "karpenter-controller-node-group-20220312165226457900000002-20220312172337541600000004" -> (known after apply)
      ~ role       = "karpenter-controller-node-group-20220312165226457900000002" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this"  {
      ~ certificates = [
          - {
              - is_ca                = true
              - issuer               = "OU=Starfield Class 2 Certification Authority,O=Starfield Technologies\\, Inc.,C=US"
              - not_after            = "2034-06-28T17:39:16Z"
              - not_before           = "2009-09-02T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "12037640545166866303"
              - sha1_fingerprint     = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - version              = 3
            },
          - {
              - is_ca                = true
              - issuer               = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - not_after            = "2037-12-31T01:00:00Z"
              - not_before           = "2015-05-25T12:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "144918191876577076464031512351042010504348870"
              - sha1_fingerprint     = "06b25927c42a721631c1efd9431e648fa62e1e39"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - is_ca                = true
              - issuer               = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - not_after            = "2025-10-19T00:00:00Z"
              - not_before           = "2015-10-22T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "144918209630989264145272943054026349679957517"
              - sha1_fingerprint     = "917e732d330f9a12404f73d8bea36948b929dffc"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon,OU=Server CA 1B,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - is_ca                = false
              - issuer               = "CN=Amazon,OU=Server CA 1B,O=Amazon,C=US"
              - not_after            = "2022-07-12T23:59:59Z"
              - not_before           = "2021-06-13T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "9157200613194073099208944830118320123"
              - sha1_fingerprint     = "579a7c336f718637adbb9147ef7ca643341053b6"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=oidc.eks.ap-northeast-1.amazonaws.com"
              - version              = 3
            },
        ] -> (known after apply)
      ~ id           = "2022-03-12 17:23:11.777810353 +0000 UTC" -> (known after apply)
      ~ url          = "https://oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB" -> (known after apply)
      - verify_chain = true -> null
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "44smkn-test"
      + platform_version          = (known after apply)
      + role_arn                  = "arn:aws:iam::171457761414:role/44smkn-test-cluster-20220312165226468400000003"
      + status                    = (known after apply)
      + tags                      = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all                  = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + version                   = "1.21"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-06cfef42c62f8d679",
            ]
          + subnet_ids                = [
              + "subnet-00fd94a44b89ebb55",
              + "subnet-0916eda26f2988dc1",
              + "subnet-0f6da23e54139ede6",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB" -> (known after apply)
      ~ id              = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB" -> (known after apply)
        tags            = {
            "Name"                               = "44smkn-test-eks-irsa"
            "karpenter.sh/discovery/44smkn-test" = "1"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.eks.module.iam_assumable_role_karpenter.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      ~ id      = "1790135142" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB:sub = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "sts:AssumeRoleWithWebIdentity",
            ] -> (known after apply)
          ~ effect        = "Allow" -> (known after apply)
          ~ not_actions   = [] -> (known after apply)
          ~ not_resources = [] -> (known after apply)
          ~ resources     = [] -> (known after apply)
          + sid           = (known after apply)

          - condition {
              - test     = "StringEquals" -> null
              - values   = [
                  - "system:serviceaccount:karpenter:karpenter",
                ] -> null
              - variable = "oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB:sub" -> null
            }
          + condition {
              + test     = (known after apply)
              + values   = (known after apply)
              + variable = (known after apply)
            }

          + not_principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }

          + principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }
          - principals {
              - identifiers = [
                  - "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB",
                ] -> null
              - type        = "Federated" -> null
            }
        }
    }

  # module.eks.module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB:sub = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "karpenter-controller-44smkn-test"
        name                  = "karpenter-controller-44smkn-test"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_autoscaling_group.this[0] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_autoscaling_group" "this" {
      - arn                       = "arn:aws:autoscaling:ap-northeast-1:171457761414:autoScalingGroup:1f2164b5-88fb-42dc-84cc-4216d2890378:autoScalingGroupName/karpenter-controller-20220312172313474200000003" -> null
      - availability_zones        = [
          - "ap-northeast-1a",
          - "ap-northeast-1c",
          - "ap-northeast-1d",
        ] -> null
      - capacity_rebalance        = false -> null
      - default_cooldown          = 300 -> null
      - desired_capacity          = 1 -> null
      - enabled_metrics           = [] -> null
      - force_delete              = false -> null
      - force_delete_warm_pool    = false -> null
      - health_check_grace_period = 300 -> null
      - health_check_type         = "EC2" -> null
      - id                        = "karpenter-controller-20220312172313474200000003" -> null
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      - max_size                  = 3 -> null
      - metrics_granularity       = "1Minute" -> null
      - min_size                  = 0 -> null
      - name                      = "karpenter-controller-20220312172313474200000003" -> null
      - name_prefix               = "karpenter-controller-" -> null
      - protect_from_scale_in     = false -> null
      - service_linked_role_arn   = "arn:aws:iam::171457761414:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      - vpc_zone_identifier       = [
          - "subnet-00fd94a44b89ebb55",
          - "subnet-0916eda26f2988dc1",
          - "subnet-0f6da23e54139ede6",
        ] -> null
      - wait_for_capacity_timeout = "10m" -> null

      - launch_template {
          - id      = "lt-09a130cab22d3a197" -> null
          - name    = "karpenter-controller-20220312172311202900000001" -> null
          - version = "1" -> null
        }

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "karpenter-controller" -> null
        }
      - tag {
          - key                 = "k8s.io/cluster/44smkn-test" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      - tag {
          - key                 = "karpenter.sh/discovery/44smkn-test" -> null
          - propagate_at_launch = true -> null
          - value               = "1" -> null
        }
      - tag {
          - key                 = "kubernetes.io/cluster/44smkn-test" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }

      - timeouts {}
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_instance_profile.this[0] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_iam_instance_profile" "this" {
      - arn         = "arn:aws:iam::171457761414:instance-profile/karpenter-controller-node-group-20220312165228200500000006" -> null
      - create_date = "2022-03-12T16:52:28Z" -> null
      - id          = "karpenter-controller-node-group-20220312165228200500000006" -> null
      - name        = "karpenter-controller-node-group-20220312165228200500000006" -> null
      - name_prefix = "karpenter-controller-node-group-" -> null
      - path        = "/" -> null
      - role        = "karpenter-controller-node-group-20220312165226457900000002" -> null
      - tags        = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all    = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - unique_id   = "AIPASP25N2CDLGHG454A3" -> null
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role.this[0] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::171457761414:role/karpenter-controller-node-group-20220312165226457900000002" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "EKSNodeAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-03-12T16:52:26Z" -> null
      - description           = "Self managed node group IAM role" -> null
      - force_detach_policies = true -> null
      - id                    = "karpenter-controller-node-group-20220312165226457900000002" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "karpenter-controller-node-group-20220312165226457900000002" -> null
      - name_prefix           = "karpenter-controller-node-group-" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all              = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - unique_id             = "AROASP25N2CDL2BQIH4SR" -> null

      - inline_policy {}
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "karpenter-controller-node-group-20220312165226457900000002-20220312165228524000000009" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "karpenter-controller-node-group-20220312165226457900000002" -> null
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "karpenter-controller-node-group-20220312165226457900000002-20220312165228514300000007" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "karpenter-controller-node-group-20220312165226457900000002" -> null
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "karpenter-controller-node-group-20220312165226457900000002-20220312165228514600000008" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "karpenter-controller-node-group-20220312165226457900000002" -> null
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_launch_template.this[0] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_launch_template" "this" {
      - arn                     = "arn:aws:ec2:ap-northeast-1:171457761414:launch-template/lt-09a130cab22d3a197" -> null
      - default_version         = 1 -> null
      - description             = "Custom launch template for karpenter-controller self managed node group" -> null
      - disable_api_termination = false -> null
      - id                      = "lt-09a130cab22d3a197" -> null
      - image_id                = "ami-03975f2e9ba15a239" -> null
      - instance_type           = "t3a.medium" -> null
      - latest_version          = 1 -> null
      - name                    = "karpenter-controller-20220312172311202900000001" -> null
      - name_prefix             = "karpenter-controller-" -> null
      - security_group_names    = [] -> null
      - tags                    = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all                = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - update_default_version  = true -> null
      - user_data               = "IyEvYmluL2Jhc2gKc2V0IC1lCkI2NF9DTFVTVEVSX0NBPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVU0xZWtORFFXTXJaMEYzU1VKQlowbENRVVJCVGtKbmEzRm9hMmxIT1hjd1FrRlJjMFpCUkVGV1RWSk5kMFZSV1VSV1VWRkVSWGR3Y21SWFNtd0tZMjAxYkdSSFZucE5RalJZUkZSSmVVMUVUWGhOYWtVelRWUnJNVTFzYjFoRVZFMTVUVVJOZDA5VVJUTk5WR3N4VFd4dmQwWlVSVlJOUWtWSFFURlZSUXBCZUUxTFlUTldhVnBZU25WYVdGSnNZM3BEUTBGVFNYZEVVVmxLUzI5YVNXaDJZMDVCVVVWQ1FsRkJSR2RuUlZCQlJFTkRRVkZ2UTJkblJVSkJTbkoyQ2t4VWREZzJaR1JNTVdOM2NXVjVkalJWVkRkRFFWVmpSbXMwYzA5YVUyNHpPRGRJTW5jd1EwNU9jbWg2ZWpWS1RVMVhXVkI2UldOb2QyNXdTRVpQVnpVS2R6ZFBLMVZpUzJaSVlVRjZkMDVYVTA5bWJUTTVNWEpYVVZSalVURlJOekpUZEdnclZESnJkelZKZW1KMVFWbDBkVTh4YW1saVZHcFVZbVpVVms5NmVncFRiM1pzVFVWUE1YSkhNaXMwYUdFdlIzRnRTVVpyTUV4V2VXOXJSWG8yUmpGWkszbHpVVEZDYzFoSWVWSktNblYwYW05b0x6ZGhaelJ5UjJGNFNVNDVDazV5SzJKRldqRkpZM0p0WlZsSGQzWnJXVlJVVFV4bmRsaGtSbVZVV1RadGFIQm1WRWhuVG5waE1sTkZVV1ZHTkZaVFozaHRTVUlyYzFGU1kxWklhR2tLVFdsMVFuVnZSRGgzTVZNNGRrbHdRblJOTVhsUlRrVnlSbTVpYzJNeGEyWnRhWEJtV0VWU1lXUmxWemM0TVRoSmJrMXNSeXNyWVVOR1dVUktNVTVsYlFvNFJVeExSR2xNZUZOd1MyZ3labkY2VG1SRlEwRjNSVUZCWVU1RFRVVkJkMFJuV1VSV1VqQlFRVkZJTDBKQlVVUkJaMHRyVFVFNFIwRXhWV1JGZDBWQ0NpOTNVVVpOUVUxQ1FXWTRkMGhSV1VSV1VqQlBRa0paUlVaRVRXSklSbkZ0VFRsamExWlpjRVZWYlZwbmNEVXZWa1JNVEZCTlFUQkhRMU54UjFOSllqTUtSRkZGUWtOM1ZVRkJORWxDUVZGQlUzVnJaMkZIY0ROVlVFWTVRVlJsVG1wQ1RtbGhOQ3QyWlZKNlNEQm5XR1Z1Tmt4MldWa3JVM0Y2UTNvMkwySnFkd3AzSzJOTVdHTnZkalpMUVVVMFFWbzBRbFJDTDJKS2VFaG5jVzVZTUc5M2JGWkJjbWcxYkhaWVRqRlRVekpJUVRJMWRETm9aV0U0TTB4MVpXbE1ObkZhQ2s1MVdqTTVlR295YW1sS04xWmlVRWxpTWxKWk9EVjJSbWxUTDFBNFZsRnpOVzVPYzJKWVJXUkRRVFpNYTJkUVRrOWxjV0Z4VWpGbllTdElORlZpYUdVS0t6TnRSRXBMVTNwU2MwTlllSGR6UVhsSVVVNTRjbTQyY0hveGJtWXhaelprTkV0eFRqZDFiRzV6VWxCdmIzUnFWVXhsVkU1NWIwWndaRWhaYXpWdlFRcE5Oalp6VW5KMGExSnVRemgxTDFFNWVraFRiMlJhU25WR1VHMWFjVWRJUzBSUlRWaFFSSGRsZUdWRlNtOHpSblk1V0ZObE1FaEVTazh6YTIweEsxSjNDbkp6Tm5CSWNGTkhVbkZ2U2pkemJta3laWGxQU0ZocmFXeEhlaXRXYjJGWU0wcHJjZ290TFMwdExVVk9SQ0JEUlZKVVNVWkpRMEZVUlMwdExTMHRDZz09CkFQSV9TRVJWRVJfVVJMPWh0dHBzOi8vQjM1RURGNjNDM0YzRTJEMDMyNjM3QUM4QjcyN0VERkIuZ3I3LmFwLW5vcnRoZWFzdC0xLmVrcy5hbWF6b25hd3MuY29tCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCA0NHNta24tdGVzdCAgLS1iNjQtY2x1c3Rlci1jYSAkQjY0X0NMVVNURVJfQ0EgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJEFQSV9TRVJWRVJfVVJMCg==" -> null
      - vpc_security_group_ids  = [
          - "sg-030c31b3f618a340d",
          - "sg-048fbe4e904b36704",
        ] -> null

      - iam_instance_profile {
          - arn = "arn:aws:iam::171457761414:instance-profile/karpenter-controller-node-group-20220312165228200500000006" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - monitoring {
          - enabled = true -> null
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Name"                               = "karpenter-controller"
              - "karpenter.sh/discovery/44smkn-test" = "1"
            } -> null
        }
      - tag_specifications {
          - resource_type = "network-interface" -> null
          - tags          = {
              - "Name"                               = "karpenter-controller"
              - "karpenter.sh/discovery/44smkn-test" = "1"
            } -> null
        }
      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "Name"                               = "karpenter-controller"
              - "karpenter.sh/discovery/44smkn-test" = "1"
            } -> null
        }
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_security_group.this[0] will be destroyed
  # (because module.eks.module.eks.module.self_managed_node_group["0"] is not in configuration)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:171457761414:security-group/sg-048fbe4e904b36704" -> null
      - description            = "Self managed node group security group" -> null
      - egress                 = [] -> null
      - id                     = "sg-048fbe4e904b36704" -> null
      - ingress                = [] -> null
      - name                   = "karpenter-controller-node-group-20220312165226457200000001" -> null
      - name_prefix            = "karpenter-controller-node-group-" -> null
      - owner_id               = "171457761414" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"                               = "karpenter-controller-node-group"
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all               = {
          - "Name"                               = "karpenter-controller-node-group"
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - vpc_id                 = "vpc-025c514b8cc9ebff3" -> null
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "karpenter-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-00fd94a44b89ebb55",
          + "subnet-0916eda26f2988dc1",
          + "subnet-0f6da23e54139ede6",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "karpenter"
        }
      + tag {
          + key                 = "k8s.io/cluster/44smkn-test"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "karpenter.sh/discovery/44smkn-test"
          + propagate_at_launch = true
          + value               = "1"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/44smkn-test"
          + propagate_at_launch = true
          + value               = "owned"
        }

      + timeouts {}
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "karpenter-node-group-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all    = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + unique_id   = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Self managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "karpenter-node-group-"
      + path                  = "/"
      + tags                  = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all              = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for karpenter self managed node group"
      + id                     = (known after apply)
      + image_id               = "ami-03975f2e9ba15a239"
      + instance_type          = "t3a.medium"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "karpenter-"
      + tags                   = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all               = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"                               = "karpenter"
              + "karpenter.sh/discovery/44smkn-test" = "1"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"                               = "karpenter"
              + "karpenter.sh/discovery/44smkn-test" = "1"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"                               = "karpenter"
              + "karpenter.sh/discovery/44smkn-test" = "1"
            }
        }
    }

  # module.eks.module.eks.module.self_managed_node_group["karpenter"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Self managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "karpenter-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                               = "karpenter-node-group"
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all               = {
          + "Name"                               = "karpenter-node-group"
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + vpc_id                 = "vpc-025c514b8cc9ebff3"
    }

Plan: 11 to add, 2 to change, 10 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.aws_eks_cluster.this[0] has been deleted
  - resource "aws_eks_cluster" "this" {
      - arn                       = "arn:aws:eks:ap-northeast-1:171457761414:cluster/44smkn-test" -> null
      - certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhNakUzTVRrMU1sb1hEVE15TURNd09URTNNVGsxTWxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBSnJ2CkxUdDg2ZGRMMWN3cWV5djRVVDdDQVVjRms0c09aU24zODdIMncwQ05Ocmh6ejVKTU1XWVB6RWNod25wSEZPVzUKdzdPK1ViS2ZIYUF6d05XU09mbTM5MXJXUVRjUTFRNzJTdGgrVDJrdzVJemJ1QVl0dU8xamliVGpUYmZUVk96egpTb3ZsTUVPMXJHMis0aGEvR3FtSUZrMExWeW9rRXo2RjFZK3lzUTFCc1hIeVJKMnV0am9oLzdhZzRyR2F4SU45Ck5yK2JFWjFJY3JtZVlHd3ZrWVRUTUxndlhkRmVUWTZtaHBmVEhnTnphMlNFUWVGNFZTZ3htSUIrc1FSY1ZIaGkKTWl1QnVvRDh3MVM4dklwQnRNMXlRTkVyRm5ic2Mxa2ZtaXBmWEVSYWRlVzc4MThJbk1sRysrYUNGWURKMU5lbQo4RUxLRGlMeFNwS2gyZnF6TmRFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZETWJIRnFtTTlja1ZZcEVVbVpncDUvVkRMTFBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBU3VrZ2FHcDNVUEY5QVRlTmpCTmlhNCt2ZVJ6SDBnWGVuNkx2WVkrU3F6Q3o2L2Jqdwp3K2NMWGNvdjZLQUU0QVo0QlRCL2JKeEhncW5YMG93bFZBcmg1bHZYTjFTUzJIQTI1dDNoZWE4M0x1ZWlMNnFaCk51WjM5eGoyamlKN1ZiUEliMlJZODV2RmlTL1A4VlFzNW5Oc2JYRWRDQTZMa2dQTk9lcWFxUjFnYStINFViaGUKKzNtREpLU3pSc0NYeHdzQXlIUU54cm42cHoxbmYxZzZkNEtxTjd1bG5zUlBvb3RqVUxlVE55b0ZwZEhZazVvQQpNNjZzUnJ0a1JuQzh1L1E5ekhTb2RaSnVGUG1acUdIS0RRTVhQRHdleGVFSm8zRnY5WFNlMEhESk8za20xK1J3CnJzNnBIcFNHUnFvSjdzbmkyZXlPSFhraWxHeitWb2FYM0prcgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> null
      - created_at                = "2022-03-12 17:14:35.347 +0000 UTC" -> null
      - enabled_cluster_log_types = [
          - "api",
          - "audit",
          - "authenticator",
        ] -> null
      - endpoint                  = "https://B35EDF63C3F3E2D032637AC8B727EDFB.gr7.ap-northeast-1.eks.amazonaws.com" -> null
      - id                        = "44smkn-test" -> null
      - identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-northeast-1.amazonaws.com/id/B35EDF63C3F3E2D032637AC8B727EDFB"
                    },
                ]
            },
        ] -> null
      - name                      = "44smkn-test" -> null
      - platform_version          = "eks.5" -> null
      - role_arn                  = "arn:aws:iam::171457761414:role/44smkn-test-cluster-20220312165226468400000003" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all                  = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - version                   = "1.21" -> null

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
        }

      - timeouts {}

      - vpc_config {
          - cluster_security_group_id = "sg-09b658dd4f2c8aab6" -> null
          - endpoint_private_access   = false -> null
          - endpoint_public_access    = true -> null
          - public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> null
          - security_group_ids        = [
              - "sg-06cfef42c62f8d679",
            ] -> null
          - subnet_ids                = [
              - "subnet-00fd94a44b89ebb55",
              - "subnet-0916eda26f2988dc1",
              - "subnet-0f6da23e54139ede6",
            ] -> null
          - vpc_id                    = "vpc-025c514b8cc9ebff3" -> null
        }
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_autoscaling_group.this[0] has changed
  ~ resource "aws_autoscaling_group" "this" {
      + enabled_metrics           = []
        id                        = "karpenter-controller-20220312172313474200000003"
      + load_balancers            = []
        name                      = "karpenter-controller-20220312172313474200000003"
      + suspended_processes       = []
      + target_group_arns         = []
      + termination_policies      = []
        # (18 unchanged attributes hidden)



        # (6 unchanged blocks hidden)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "karpenter-controller-node-group-20220312165226457900000002"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
            # (3 unchanged elements hidden)
        ]
        name                  = "karpenter-controller-node-group-20220312165226457900000002"
        tags                  = {
            "karpenter.sh/discovery/44smkn-test" = "1"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_launch_template.this[0] has changed
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-09a130cab22d3a197"
        name                    = "karpenter-controller-20220312172311202900000001"
      + security_group_names    = []
        tags                    = {
            "karpenter.sh/discovery/44smkn-test" = "1"
        }
        # (12 unchanged attributes hidden)




        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":32,"Program":"tfcmt","SHA1":"7b0f6ae9a21b575efcd0103c96c08a639afe8ea7","Target":"aws/eks","Vars":{},"WorkflowName":"test"} -->